//  คำตอบที่ต้องการ
//  1) มีจำนวนนักเรียนทั้งหมดกี่คน
//  2) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" และมีจำนวนนักเรียนเท่ากับกี่คน
//  3) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" และมีจำนวนนักเรียนเท่ากับกี่คน
//  4) แสดงชื่อนักเรียนทั้งหมด และแสดงเพศของนักเรียนแต่ละคน
//  5) แสดงลำดับของนักเรียนแต่ละคน
// มีจำนวนนักเรียนเท่ากับกี่คน
// มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
// มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
//  6) แสดงรายการพัสดุ พร้อมทั้งบอกว่ามาจากไทยหรือต่างประเทศ
// มีแสดงจำนวนพัสดุทั้งหมดเท่าไหร่
// มีจำนวนพัสดุที่มาจากไทยเท่าไหร่
// มีจำนวนพัสดุที่มาจากต่างประเทศเท่าไหร่
package W14;

public class W14_02_Array_Gender {

    public static void main(String[] args) {
        // สร้าง Array ชื่อ name เพื่อเก็บชื่อนักเรียน จำนวน 5 คน
        String[] name = {"นายสมชาย", "นางสมใจ", "นางสาวสมนึก", "นายสมดี", "นางสาวสมฤทัย"};
        String[] codes = {"123TH", "124EN", "125EN", "126TH", "127EN"};

        // 1) แสดงจำนวนนักเรียนทั้งหมด
        System.out.println("จำนวนนักเรียนทั้งหมด" + name.length + " คน");
        System.out.println("====================================");

        // 2) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" [startsWith()] และมีจำนวนนักเรียนเท่ากับกี่คน
        // แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย"
        // และมีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("ชื่อนักเรียนขึ้นต้นด้วยคำว่า 'นาย'");
        //System.out.println(name[0]);
        //System.out.println(name[0]);
        int cout = 0;
        for (int i = 0; i < name.length; i++) {
            if (name[i].startsWith("นาย")) {
                System.out.println(name[i]);
                cout++;
            }

        }
        System.out.println("จำนวนนักเรียนชายทั้งหมด" + cout + " คน");
        System.out.println("====================================");

        //  3) แสดงเฉพาะชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" 
        // และมีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("ชื่อนักเรียนขึ้นต้นด้วยคำว่า 'นาง'");
        cout = 0;
        for (int i = 0; i < name.length; i++) {
            if (name[i].startsWith("นาง")) {
                System.out.println(name[i]);
                cout++;
            }
        }
        System.out.println("จำนวนนักเรียนหญิงทั้งหมด" + cout + " คน");
        System.out.println("====================================");
        // 4) แสดงชื่อนักเรียนทั้งหมด และแสดงเพศของนักเรียนแต่ละคน
        // ถ้าชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาย" ให้แสดงว่าเป็นเพศชาย
        // ถ้าชื่อนักเรียนขึ้นต้นด้วยคำว่า "นาง" ให้แสดงว่าเป็นเพศหญิง
        // มีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("ชื่อนักเรียนทั้งหมด");
        cout = 0;
        for (int i = 0; i < name.length; i++) {
            if (name[i].startsWith("นาย")) {
                System.out.println(name[i] + "เป็นเพศชาย");
                cout++;
            } else {
                System.out.println(name[i] + "เป็นเพศหญิง");
                cout++;
            }

        }
        System.out.println("จำนวนนักเรียนทั้งหมด" + cout + " คน");
        System.out.println("====================================");

        // 5) แสดงเลขลำดับของนักเรียนแต่ละคน 
        // มีจำนวนนักเรียนเท่ากับกี่คน
        // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
        // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
        System.out.println("ชื่อนักเรียนทั้งหมด");
        int coutAll = 0;
        int coutmale = 0;
        for (int i = 0; i < name.length; i++) {
            if (name[i].startsWith("นาย")) {
                System.out.println((i + 1) + "." + name[i] + "เป็นเพศชาย");
                coutAll++;
                coutmale++;
            } else {
                System.out.println((i + 1) + "." + name[i] + "เป็นเพศหญิง");
                coutAll++;

            }
        }
        // มีจำนวนนักเรียนเท่ากับกี่คน
        System.out.println("จำนวนนักเรียนทั้งหมด " + cout + " คน");
        // มีจำนวนนักเรียนเพศชายเท่ากับกี่คน
        System.out.println("จำนวนนักเรียนชายทั้งหมด " + coutmale + " คน");
        // มีจำนวนนักเรียนเพศหญิงเท่ากับกี่คน
        System.out.println("จำนวนนักเรียนหญิงทั้งหมด " + (coutAll - coutmale) + " คน");
        System.out.println("====================================");

        //  6) แสดงรายการพัสดุ พร้อมทั้งบอกว่ามาจากไทยหรือต่างประเทศ
        // มีแสดงจำนวนพัสดุทั้งหมดเท่าไหร่
        System.out.println("จำนวนพัสดุทั้งหมด" + codes.length + " อัน");
        System.out.println("====================================");
        // มีจำนวนพัสดุที่มาจากไทยเท่าไหร่
        cout = 0;
        for (int i = 0; i < codes.length; i++) {
            if (codes[i].startsWith("TH")) {
                System.out.println(codes[i]);
                cout++;
            }
        }
        // มีจำนวนพัสดุที่มาจากต่างประเทศเท่าไหร่
        cout = 0;
        int Number = 0;
        for (int i = 0; i < codes.length; i++) {
            if (codes[i].startsWith("TH")) {
                System.out.println(codes[i]);
                cout++;
            } else {
                Number++;
            }
        }
        System.out.println("จำนวนพัสดุที่มาจากไทย" + cout + " อัน");
        System.out.println("จำนวนจำนวนพัสดุที่มาจากต่างประเทศ" + Number + " อัน");
        System.out.println("====================================");
    }

}
